In [14]:
import pandas as pd
import numpy as np

In [3]:
data ={'hanzhou':10000, 'beijing':20000, 'shenzhen':18000, 'tianjing':15000}

In [15]:
help(np.size)

Help on function size in module numpy.core.fromnumeric:

size(a, axis=None)
    Return the number of elements along a given axis.

    Parameters
    ----------
    a : array_like
        Input data.
    axis : int, optional
        Axis along which the elements are counted.  By default, give
        the total number of elements.

    Returns
    -------
    element_count : int
        Number of elements along the specified axis.

    See Also
    --------
    shape : dimensions of array
    ndarray.shape : dimensions of array
    ndarray.size : number of elements in array

    Examples
    --------
    >>> a = np.array([[1,2,3],[4,5,6]])
    >>> np.size(a)
    6
    >>> np.size(a,1)
    3
    >>> np.size(a,0)
    2

In [6]:
s1=pd.Series(data, name='HousePrice', index=data.keys())
s1

beijing     20000
tianjing    15000
hanzhou     10000
shenzhen    18000
Name: HousePrice, dtype: int64

In [7]:
s1.sort_index('index')

beijing     20000
hanzhou     10000
shenzhen    18000
tianjing    15000
Name: HousePrice, dtype: int64

In [10]:
s1.sort_index(axis=0)

beijing     20000
hanzhou     10000
shenzhen    18000
tianjing    15000
Name: HousePrice, dtype: int64

In [9]:
s1.sort_index(0)

beijing     20000
hanzhou     10000
shenzhen    18000
tianjing    15000
Name: HousePrice, dtype: int64

In [20]:
apple=pd.read_csv('/Users/wang/mygit/python/pandas/AAPL.csv')
apple.head(), apple.shape

(         Date      Open      High       Low     Close  Adj Close       Volume
 0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.423252  117258400.0
 1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.401170   43971200.0
 2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.371726   26432000.0
 3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.380927   21610400.0
 4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.391969   18362400.0,
 (9231, 7))

In [12]:
data2 ={'hanzhou':18000, 'beijing':10000, 'shenzhen':24000, 'tianjing':19000}

In [13]:
df = pd.DataFrame([data, data2], index=[2016,2017])
df

      beijing  hanzhou  shenzhen  tianjing
2016    20000    10000     18000     15000
2017    10000    18000     24000     19000

In [29]:
df1=pd.DataFrame([pd.Series(data)])
df2=pd.DataFrame([pd.Series(data2)])

df=pd.DataFrame([data,data2], index=[2018,2017])
df

      beijing  hanzhou  shenzhen  tianjing
2018    20000    10000     18000     15000
2017    30000    18000     24000     19000

In [38]:
df.sort_index(axis=1,ascending=True)

      beijing  hanzhou  shenzhen  tianjing
2016    20000    10000     18000     15000
2017    10000    18000     24000     19000

In [39]:
group_by_name = salaries.groupby('Name')
print group_by_name.mean()

             Bonus   Salary         Year
Name
Han    1200.000000   5000.0  2016.000000
July   2575.000000  14250.0  2016.750000
Zewei   833.333333   3000.0  2016.333333

In [11]:
import pandas as pd
import numpy as np

salaries = pd.DataFrame({
    'Name': ['July', 'Zewei', 'Zewei', 'Han', 'July', 'July', 'Zewei', 'July'],
    'Year': [2016,2016,2016,2016,2017,2017,2017,2017],
    'Salary': [10000,2000,4000,5000,18000,25000,3000,4000],
    'Bonus': [3000,1000,1000,1200,4000,2300,500,1000]
})
salaries

   Bonus   Name  Salary  Year
0   3000   July   10000  2016
1   1000  Zewei    2000  2016
2   1000  Zewei    4000  2016
3   1200    Han    5000  2016
4   4000   July   18000  2017
5   2300   July   25000  2017
6    500  Zewei    3000  2017
7   1000   July    4000  2017

In [13]:
salaries.sort_index(axis=0)

   Bonus   Name  Salary  Year
0   3000   July   10000  2016
1   1000  Zewei    2000  2016
2   1000  Zewei    4000  2016
3   1200    Han    5000  2016
4   4000   July   18000  2017
5   2300   July   25000  2017
6    500  Zewei    3000  2017
7   1000   July    4000  2017